cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32GG230F512.svd
<?xml version="1.0" encoding="utf-8"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <name>EFM32GG230F512</name>
  <version>5.7.0</version>
  <description>Silicon Labs EFM32GG230F512 Cortex-M MCU</description>
  <licenseText>
    *******************************************************************************\n
    * @version 5.7.0                                                              \n
    *******************************************************************************\n
    * # License                                                                    \n
    * Copyright 2018 Silicon Laboratories Inc. www.silabs.com                      \n
    *******************************************************************************\n
    *                                                                              \n
    * SPDX-License-Identifier: Zlib                                                \n
    *                                                                              \n
    * The licensor of this software is Silicon Laboratories Inc.                   \n
    *                                                                              \n
    * This software is provided 'as-is', without any express or implied            \n
    * warranty. In no event will the authors be held liable for any damages        \n
    * arising from the use of this software.                                       \n
    *                                                                              \n
    * Permission is granted to anyone to use this software for any purpose,        \n
    * including commercial applications, and to alter it and redistribute it       \n
    * freely, subject to the following restrictions:                               \n
    *                                                                              \n
    * 1. The origin of this software must not be misrepresented; you must not      \n
    *    claim that you wrote the original software. If you use this software      \n
    *    in a product, an acknowledgment in the product documentation would be     \n
    *    appreciated but is not required.                                          \n
    * 2. Altered source versions must be plainly marked as such, and must not be   \n
    *    misrepresented as being the original software.                            \n
    * 3. This notice may not be removed or altered from any source distribution.   \n
    *                                                                              \n
    *******************************************************************************
  </licenseText>
  <cpu>
    <name>CM3</name>
      <revision>r2p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>DMA</name>
      <version>5.7.0</version>
      <description>DMA</description>
      <baseAddress>0x400C2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>STATUS</name>
          <description>DMA Status Registers</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x100B0000</resetValue>
          <resetMask>0x001F00F1</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>DMA Enable Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>Control Current State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDCHCTRLDATA</name>
                  <description>Reading channel controller data</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDSRCENDPTR</name>
                  <description>Reading source data end pointer</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDDSTENDPTR</name>
                  <description>Reading destination data end pointer</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDSRCDATA</name>
                  <description>Reading source data</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRDSTDATA</name>
                  <description>Writing destination data</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITREQCLR</name>
                  <description>Waiting for DMA request to clear</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRCHCTRLDATA</name>
                  <description>Writing channel controller data</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALLED</name>
                  <description>Stalled</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>Done</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERSCATTRANS</name>
                  <description>Peripheral scatter-gather transition</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHNUM</name>
              <description>Channel Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>DMA Configuration Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000021</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHPROT</name>
              <description>Channel Protection Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLBASE</name>
          <description>Channel Control Data Base Pointer Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRLBASE</name>
              <description>Channel Control Data Base Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTCTRLBASE</name>
          <description>Channel Alternate Control Data Base Pointer Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALTCTRLBASE</name>
              <description>Channel Alternate Control Data Base Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHWAITSTATUS</name>
          <description>Channel Wait on Request Status Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000FFF</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CH0WAITSTATUS</name>
              <description>Channel 0 Wait on Request Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1WAITSTATUS</name>
              <description>Channel 1 Wait on Request Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2WAITSTATUS</name>
              <description>Channel 2 Wait on Request Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3WAITSTATUS</name>
              <description>Channel 3 Wait on Request Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4WAITSTATUS</name>
              <description>Channel 4 Wait on Request Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5WAITSTATUS</name>
              <description>Channel 5 Wait on Request Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6WAITSTATUS</name>
              <description>Channel 6 Wait on Request Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7WAITSTATUS</name>
              <description>Channel 7 Wait on Request Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH8WAITSTATUS</name>
              <description>Channel 8 Wait on Request Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH9WAITSTATUS</name>
              <description>Channel 9 Wait on Request Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH10WAITSTATUS</name>
              <description>Channel 10 Wait on Request Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH11WAITSTATUS</name>
              <description>Channel 11 Wait on Request Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSWREQ</name>
          <description>Channel Software Request Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CH0SWREQ</name>
              <description>Channel 0 Software Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1SWREQ</name>
              <description>Channel 1 Software Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2SWREQ</name>
              <description>Channel 2 Software Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3SWREQ</name>
              <description>Channel 3 Software Request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4SWREQ</name>
              <description>Channel 4 Software Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH5SWREQ</name>
              <description>Channel 5 Software Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH6SWREQ</name>
              <description>Channel 6 Software Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7SWREQ</name>
              <description>Channel 7 Software Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH8SWREQ</name>
              <description>Channel 8 Software Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH9SWREQ</name>
              <description>Channel 9 Software Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH10SWREQ</name>
              <description>Channel 10 Software Request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH11SWREQ</name>
              <description>Channel 11 Software Request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHUSEBURSTS</name>
          <description>Channel Useburst Set Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CH0USEBURSTS</name>
              <description>Channel 0 Useburst Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1USEBURSTS</name>
              <description>Channel 1 Useburst Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2USEBURSTS</name>
              <description>Channel 2 Useburst Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3USEBURSTS</name>
              <description>Channel 3 Useburst Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4USEBURSTS</name>
              <description>Channel 4 Useburst Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5USEBURSTS</name>
              <description>Channel 5 Useburst Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6USEBURSTS</name>
              <description>Channel 6 Useburst Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7USEBURSTS</name>
              <description>Channel 7 Useburst Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH8USEBURSTS</name>
              <description>Channel 8 Useburst Set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH9USEBURSTS</name>
              <description>Channel 9 Useburst Set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH10USEBURSTS</name>
              <description>Channel 10 Useburst Set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH11USEBURSTS</name>
              <description>Channel 11 Useburst Set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
